******************************
* Vendor Upload
******************************

01 Ams-Vendor.
   03 Brand               Pic x(3).
   03 Vendor-Number       Pic 9(8).
   03 Vendor-Name         Pic X(40).
   03 Filler-1            Pic X(15).
   03 Code-850            Pic 999.
   03 Value-P             Pic X.
   03 Filler              Pic X(3).
   03 Zero-Value          Pic 999.